Tekla.Structures.Drawing.DrawingHandler
The DrawingHandler class initializes the interface from a .NET application to Tekla Structures. This object
must be created before any actions can be performed on Tekla Structures drawings.
When this object is created, it is possible to ask the current active
drawing in Tekla Structures, get a list of drawings or create a new drawing.
using Tekla.Structures.Drawing;
public class Example
{
public void Example1()
{
// Open the interface, get the current drawing and loop through all the views in the drawing.
DrawingHandler DrawingHandler = new DrawingHandler();
if(DrawingHandler.GetConnectionStatus())
{
Drawing CurrentDrawing = DrawingHandler.GetActiveDrawing();
if(CurrentDrawing != null)
{
DrawingObjectEnumerator Enum = CurrentDrawing.GetSheet().GetViews();
while(Enum.MoveNext())
{
Tekla.Structures.Drawing.View View = Enum.Current as Tekla.Structures.Drawing.View;
// Perform actions for the view here.
}
}
}
}
}
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
// Add some views.
DrawingHandler DrawingHandler = new DrawingHandler();
Drawing MyDrawing = DrawingHandler.GetActiveDrawing();
if(MyDrawing == null) // If the drawing editor is not open, create a new drawing with standard settings.
{
MyDrawing = new GADrawing();
MyDrawing.Insert();
}
DrawingHandler.SetActiveDrawing(MyDrawing, false);
if(MyDrawing != null)
{
Tekla.Structures.Drawing.View MyView = new Tekla.Structures.Drawing.View(MyDrawing.GetSheet(), new CoordinateSystem(), new CoordinateSystem(), new AABB(new Point(), new Point(10000, 10000, 10000)));
MyView.Insert();
MyView = new Tekla.Structures.Drawing.View(MyDrawing.GetSheet(), new CoordinateSystem(), new CoordinateSystem(), new AABB(new Point(), new Point(30000, 30000, 10000)));
MyView.Insert();
}
DrawingHandler.SaveActiveDrawing(); // Save is needed if the drawing is opened to the editor with SetActiveDrawing.
}
}

Tekla.Structures.Drawing.DrawingHandler.Instance
The instance.

Tekla.Structures.Drawing.DrawingHandler.#ctor
Creates a new drawing handler instance, a "handle" to Tekla.Structures.Drawing.
When a drawing handler object is created, it is possible to ask the current active drawing
in Tekla Structures, get a list of drawings or create a new drawing.

Tekla.Structures.Drawing.DrawingHandler.GetActiveDrawingIdentifier
Gets the identifier for active drawing
Returns: Active drawing identifier

Tekla.Structures.Drawing.DrawingHandler.GetActiveDrawingType
Gets the type of active drawing
Returns: Active drawing type

Tekla.Structures.Drawing.DrawingHandler.GetDrawingType(Tekla.Structures.Identifier)
Gets the type of given drawing's id
Returns: Active drawing type

Tekla.Structures.Drawing.DrawingHandler.GetCachedDrawingType(Tekla.Structures.Identifier)
Gets the cached type of given drawing's id
Returns: Cached drawing type

Tekla.Structures.Drawing.DrawingHandler.GetConnectionStatus
Returns true if a proper connection to the Tekla Structures process has been established. A proper connection
to Tekla Stuctures in the drawing API needs Tekla Structures up and running and a model open.
Currently, there's no way to re-establish the connection.
Returns: True on success.

Tekla.Structures.Drawing.DrawingHandler.SetMessageExecutionStatus(Tekla.Structures.Drawing.DrawingHandler.MessageExecutionModeEnum)
Sets the message execution mode for the application.
mode: The new mode.
Returns: The old message execution mode.
Tekla.Structures.Drawing.DrawingHandler.MessageExecutionModeEnum

Tekla.Structures.Drawing.DrawingHandler.GetMessageExecutionStatus
Gets the current message execution mode for the application.
Returns: The current message execution mode.

Tekla.Structures.Drawing.DrawingHandler.GetDrawings
Gets all the drawings from the database.
Returns: All the drawings from the database.

Tekla.Structures.Drawing.DrawingHandler.GetAnnotationDrawings
Gets all annotation drawings.
Returns: All annotation drawings from the database.

Tekla.Structures.Drawing.DrawingHandler.GetDrawingSelector
Gets a drawing selector.
With a drawing selector the list of selected drawings can be gotten.
Returns: The drawing selector.

Tekla.Structures.Drawing.DrawingHandler.GetDrawingObjectSelector
Gets a drawing object selector.
With a drawing object selector drawing objects can be selected and highlighted in the drawing editor.
A drawing object selector also provides a list of currently selected drawing objects.
Returns: The drawing object selector for the current drawing. Null if no drawing is active.

Tekla.Structures.Drawing.DrawingHandler.GetPicker
Gets a picker for picking points and objects in a drawing.
Returns: A picker object if the drawing editor is open. Otherwise null.

Tekla.Structures.Drawing.DrawingHandler.GetActiveDrawing
Returns an instance of the active drawing that is currently open in Tekla Structures.
Returns: The drawing that is open in Tekla Structures or null if no drawing is open.

Tekla.Structures.Drawing.DrawingHandler.IsAnyDrawingOpen
Returns information if any drawing is open.
Returns: True if a drawing is open or false if no drawing is open.

Tekla.Structures.Drawing.DrawingHandler.SetActiveDrawing(Tekla.Structures.Drawing.Drawing)
Sets the active drawing that is currently open in Tekla Structures.
drawing: The drawing to be set as the active drawing.
Returns: True on success.

Tekla.Structures.Drawing.DrawingHandler.SetActiveDrawing(Tekla.Structures.Drawing.Drawing,System.Boolean)
Sets the active drawing that is currently open in Tekla Structures.
drawing: The drawing to be set as the active drawing.
showDrawing: Whether to open the drawing as visible or in the background (faster).
Throws Tekla.Structures.Drawing.CannotPerformOperationDrawingNotUpToDateException: Thrown if the drawing is not up to date.
Returns: True on success.

Tekla.Structures.Drawing.DrawingHandler.SetActiveDrawing(Tekla.Structures.Drawing.Drawing,System.Boolean,System.Boolean)
Sets the active drawing that is currently open in Tekla Structures.
drawing: The drawing to be set as the active drawing.
showDrawing: Whether to open the drawing as visible or in the background (faster).
forceOpen: Force to open the drawing even if it is not up to date. showDrawing needs to be set to false to be able to use forceOpen
Throws Tekla.Structures.Drawing.CannotPerformOperationDrawingNotUpToDateException: Thrown if the drawing is not up to date.
Returns: True on success.

Tekla.Structures.Drawing.DrawingHandler.SaveActiveDrawing
Saves the currently open drawing.
Returns: True on success.

Tekla.Structures.Drawing.DrawingHandler.CloseActiveDrawing
Closes the drawing editor.
Returns: True on success.

Tekla.Structures.Drawing.DrawingHandler.CloseActiveDrawing(System.Boolean)
Closes the drawing editor.
save: Whether the active drawing should be saved on close.
Returns: True on success.

Tekla.Structures.Drawing.DrawingHandler.PrintDrawing(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Drawing.PrintAttributes)
Prints the drawing using the given printer instance.
NOTE! The drawing cannot be active, otherwise printing fails.
drawing: The drawing to be printed.
printAttributes: The print attributes for the print job.
Returns: True on success, false if printing fails.

Tekla.Structures.Drawing.DrawingHandler.PrintDrawing(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Drawing.PrintAttributes,System.String)
Prints the drawing to file using the given printer instance.
NOTE! The drawing cannot be active, otherwise printing fails.
drawing: The drawing to be printed.
printAttributes: The print attributes for the print job.
fileName: The name of the output file.
Returns: True on success, false if printing fails.

Tekla.Structures.Drawing.DrawingHandler.PrintDrawing(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Drawing.DPMPrinterAttributes)
Prints the drawing using the given printer attributes.
drawing: The drawing to be printed.
printAttributes: The print attributes for the print job.
Throws System.ArgumentException: Thrown if PDF printing selected, but no file name provided.
Returns: True on success, false if printing fails.

Tekla.Structures.Drawing.DrawingHandler.PrintDrawing(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Drawing.DPMPrinterAttributes,System.String)
Prints the drawing to file using the given printer attributes and name of the output file.
The given output file overrides the printer attributes file settings.
drawing: The drawing to be printed.
printAttributes: The print attributes for the print job.
outputFile: The print output file name.
Throws System.ArgumentNullException: Thrown if drawing or printerAttributes is null.
Returns: True on success, false if printing fails.
Remarks: If there is an active drawing visible in the drawing editor and it is a
different drawing to the specified drawing, the active drawing will be closed.

Tekla.Structures.Drawing.DrawingHandler.PrintDrawings(System.Collections.Generic.List{Tekla.Structures.Drawing.Drawing},Tekla.Structures.Drawing.DPMPrinterAttributes)
Prints the list of drawings using the given printer attributes.
drawings: The list of drawings to be printed.
printAttributes: The print attributes for the print job.
Throws System.ArgumentException: Thrown if PDF printing selected, but no file name provided.
Throws System.ArgumentNullException: Thrown if drawings or printerAttributes is null.
Returns: True on success, false if printing fails.
Remarks: If there is an active drawing visible in the drawing editor and it is a
different drawing to the specified drawings, the active drawing will be closed.

Tekla.Structures.Drawing.DrawingHandler.PrintDrawings(System.Collections.Generic.IEnumerable{Tekla.Structures.Drawing.Drawing},Tekla.Structures.Drawing.DPMPrinterAttributes,System.String)
Prints the list of drawings using the given printer attributes.
drawings: The list of drawings to be printed.
printAttributes: The print attributes for the print job.
OutputFolder: The output folder as an absolute path or relateive to the model folder.
Throws System.ArgumentException: Thrown if PDF printing selected, but no file name provided.
Throws System.ArgumentNullException: Thrown if drawings or printerAttributes is null.
Returns: True on success, false if printing fails.
Remarks: If there is an active drawing visible in the drawing editor and it is a
different drawing to the specified drawings, the active drawing will be closed.

Tekla.Structures.Drawing.DrawingHandler.UpdateDrawing(Tekla.Structures.Drawing.Drawing)
Updates the drawing.
This is the same as pressing Update on the drawing list for a selected drawing.
NOTE! The drawing cannot be active, otherwise the operation fails.
NOTE! Numbering must be executed before this operation.
drawing: The drawing to be updated.
Returns: True on success.

Tekla.Structures.Drawing.DrawingHandler.IssueDrawing(Tekla.Structures.Drawing.Drawing)
Issues the drawing if the drawing is not issued or was previously issued but has been modified since.
This is the same as pressing Issue on the drawing list for a selected drawing.
drawing: The drawing to be issued.
Returns: True on success.

Tekla.Structures.Drawing.DrawingHandler.UnissueDrawing(Tekla.Structures.Drawing.Drawing)
Unissues the drawing.
This is the same as pressing Unissue on the drawing list for a selected drawing.
drawing: The drawing to be unissued.
Returns: True on success.

Tekla.Structures.Drawing.DrawingHandler.GetModelObjectIdentifiers(Tekla.Structures.Drawing.Drawing)
Gets model object identifiers of the drawing.
drawing: The drawing where objects are fetched.
Returns: List of model object identifiers in the drawing.